QuangHuy-1999/Bootloader_Base_Active_dsPIC/Bootloader_code/BootLoader.X/mcc_generated_files/boot/boot_process.c

/**
  @Generated 16-bit Bootloader Source File

  @Company:
    Microchip Technology Inc.

  @File Name: 
    boot_process.c

  @Summary:
    This is the boot_process.c file generated using 16-bit Bootloader

  @Description:
    This header file provides implementations for driver APIs for all modules selected in the GUI.
    Generation Information :
        Product Revision  :  16-bit Bootloader - 1.22.1
        Device            :  dsPIC33CH512MP205
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.36B
        MPLAB             :  MPLAB X v5.15
*/
/*
Copyright (c) [2012-2023] Microchip Technology Inc.  

    All rights reserved.

    You are permitted to use the accompanying software and its derivatives 
    with Microchip products. See the Microchip license agreement accompanying 
    this software, if any, for additional info regarding your rights and 
    obligations.
    
    MICROCHIP SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT 
    WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT 
    LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT 
    AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP OR ITS
    LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT 
    LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE 
    THEORY FOR ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT 
    LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES, 
    OR OTHER SIMILAR COSTS. 
    
    To the fullest extend allowed by law, Microchip and its licensors 
    liability will not exceed the amount of fees, if any, that you paid 
    directly to Microchip to use this software. 
    
    THIRD PARTY SOFTWARE:  Notwithstanding anything to the contrary, any 
    third party software accompanying this software is subject to the terms 
    and conditions of the third party's license agreement.  To the extent 
    required by third party licenses covering such third party software, 
    the terms of such license will apply in lieu of the terms provided in 
    this notice or applicable license.  To the extent the terms of such 
    third party licenses prohibit any of the restrictions described here, 
    such restrictions will not apply to such third party software.
*/
#define FCY 90000000
#include <stdint.h>
#include <stdbool.h>
#include <string.h> 
#include "com_adaptor.h"
#include "boot_private.h"
#include "boot_process.h"
#include "boot_image.h"
#include "boot_config.h"
#include "xc.h"
#include <libpic30.h>
#include "../uart1.h"


#define EXECUTABLE_IMAGE_FIRST_ADDRESS BOOT_CONFIG_PROGRAMMABLE_ADDRESS_LOW
#define EXECUTABLE_IMAGE_LAST_ADDRESS ((unsigned long)BOOT_CONFIG_PROGRAMMABLE_ADDRESS_LOW + (unsigned long)BOOT_IMAGE_SIZE - (unsigned long)2u)
#define ACK_CMD      0x88
#define NACK_CMD     0x89
#define RESPONSE_ACK 0xC1

#if ((BOOT_CONFIG_MAX_PACKET_SIZE - SIZE_OF_CMD_STRUCT_0) < MINIMUM_WRITE_BLOCK_SIZE )
#error "The maximum packet size is not large enough to store a full write block plus header. Make the max packet size larger."
#endif


static uint8_t commandArray[BOOT_CONFIG_MAX_PACKET_SIZE];

enum BOOT_COMMAND_RESPONSES
{
    COMMAND_SUCCESS = 0x01,
    UNSUPPORTED_COMMAND = 0xFF,
    BAD_ADDRESS = 0xFE,
    BAD_LENGTH  = 0xFD,
    VERIFY_FAIL = 0xFC
};

enum BOOT_COMMAND
{
    READ_VERSION = 0x12,
    READ_FLASH = 0x01,
    WRITE_FLASH = 0x02,
    ERASE_FLASH = 0x03,
    CALC_CHECKSUM = 0x08,
    RESET_DEVICE = 0x09,
    SELF_VERIFY = 0x0A,
    GET_MEMORY_ADDRESS_RANGE_COMMAND = 0x0B,
    DFU_REQUEST = 0x11,
    HEADSET_INFO = 0xEE,
    RESPONSE_HEADSET_INFO = 0xAD
};

enum Header
{
    HEADER1 = 0x55,
    HEADER2 = 0xAA,
    HEADER3 = 0x20,
};



/******************************************************************************/
/* Private Function Prototypes                                                */
/******************************************************************************/

static enum BOOT_COMMAND_RESULT CommandError(enum BOOT_COMMAND_RESPONSES);
static enum BOOT_COMMAND_RESULT ReadVersion(void);

static void ResetDevice(void);
static enum BOOT_COMMAND_RESULT EraseFlash(void);
static enum BOOT_COMMAND_RESULT DfuRequest(void);
static enum BOOT_COMMAND_RESULT WriteFlash(void);
static enum BOOT_COMMAND_RESULT ReadFlash(void);
static enum BOOT_COMMAND_RESULT CalculateChecksum(void);
static enum BOOT_COMMAND_RESULT SelfVerify(void);
static enum BOOT_COMMAND_RESULT GetMemoryAddressRange(void);


/******************************************************************************/
/* Public Functions                                                           */
/******************************************************************************/
void BOOT_Initialize() 
{
    
}


enum BOOT_COMMAND_RESULT BOOT_ProcessCommand(void)
{    
    uint16_t bytes_ready = BOOT_COM_GetBytesReady();
    uint8_t command, command_headset_info;
    uint16_t command_length;
    
    if (bytes_ready == 0u) 
    {
        return BOOT_COMMAND_NONE; 
    }

    if (bytes_ready < sizeof(struct CMD_STRUCT_0)) 
    { 
        return BOOT_COMMAND_INCOMPLETE; 
    }
    
    command = BOOT_COM_Peek(4);
    command_headset_info = BOOT_COM_Peek(2);
    if (command_headset_info != HEADSET_INFO)
    {
        // validate the length of the command will not exceed the buffer size
        command_length = BOOT_COM_Peek(5u) + BOOT_COM_Peek(6u)*256u + sizeof(struct CMD_STRUCT_0);
        if ( ( command_length > BOOT_CONFIG_MAX_PACKET_SIZE ) && ( command != ERASE_FLASH ))
        {
            return CommandError(BAD_LENGTH);
        }
    }
    
    else if(command_headset_info == HEADSET_INFO)
    {
        struct HEADSET_INFO_RESPONSE response = {
        .header1 = HEADER1,
        .header2 = HEADER2,
        .header3 = RESPONSE_HEADSET_INFO,
        .total_length = 0x21,
        .type = 2,
        .version_major = 1,
        .version_minor = 1,
        .filter = 0
        };
        
        strcpy(response.build_date_time, __DATE__);
        strcat(response.build_date_time, " ");
        strcat(response.build_date_time, __TIME__);
        (void)BOOT_COM_Read(commandArray, 6);
        BOOT_COM_Write((uint8_t*) & response, sizeof (struct HEADSET_INFO_RESPONSE ) / sizeof (uint8_t));
    }
    
    switch (command)
    {
     
    case DFU_REQUEST:
        return DfuRequest();  
        
    case WRITE_FLASH:
        return WriteFlash();

    case READ_FLASH:
        return ReadFlash();

    case READ_VERSION:
        return ReadVersion();

    case ERASE_FLASH:
        return EraseFlash();

    case RESET_DEVICE:
        ResetDevice();
        return BOOT_COMMAND_SUCCESS;

    case CALC_CHECKSUM:
        return CalculateChecksum();

    case SELF_VERIFY:
        return SelfVerify();

     
    case GET_MEMORY_ADDRESS_RANGE_COMMAND:
        return GetMemoryAddressRange();

//    default:
//        return CommandError(UNSUPPORTED_COMMAND);
    }
    
//    return BOOT_COMMAND_ERROR;
}

void BOOT_StartApplication()
{
    int (*user_application)(void);
    user_application = (int(*)(void))BOOT_CONFIG_APPLICATION_RESET_ADDRESS;
    user_application();       
}  

/******************************************************************************/
/* Private Functions                                                          */
/******************************************************************************/

static enum BOOT_COMMAND_RESULT CommandError(enum BOOT_COMMAND_RESPONSES errorType)
{
    struct RESPONSE_TYPE_0 response;
    
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0));
    memcpy(&response, commandArray, sizeof(struct CMD_STRUCT_0));
    response.success = errorType;
    BOOT_COM_Write((uint8_t*) & response, sizeof (struct RESPONSE_TYPE_0 ) / sizeof (uint8_t));
    
    return BOOT_COMMAND_ERROR;
}

static enum BOOT_COMMAND_RESULT DfuRequest(void)
{
    struct DFU_STRUCT_RESPONSE response = {
        .header1 = HEADER1,
        .header2 = HEADER2,
        .header3 = HEADER3,
        .total_length = 0x0D,
        .cmd = 0x11,
        .dataLength = 0x2,
        .unlockSequence = 0,
        .address = 0,
        
        .function = RESPONSE_ACK,
        .status = ACK_CMD
    };
    
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0));
    BOOT_COM_Write((uint8_t*) & response, sizeof (struct DFU_STRUCT_RESPONSE ) / sizeof (uint8_t));

    return BOOT_COMMAND_SUCCESS;
}

static enum BOOT_COMMAND_RESULT ReadVersion(void)
{
    struct GET_VERSION_RESPONSE response = {
        .header1 = HEADER1,
        .header2 = HEADER2,
        .header3 = HEADER3,
        .total_length = 0x0D,
        .cmd = 0x12,
        .dataLength = 0x2,
        .unlockSequence = 0,
        .address = 0,
        
        .boot_version_major = 0x1,
        .boot_version_minor = 0x1
    };
//    response.eraseSize = BOOT_EraseSizeGet();
    
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0));
    BOOT_COM_Write((uint8_t*) & response, sizeof (struct GET_VERSION_RESPONSE ) / sizeof (uint8_t));

    return BOOT_COMMAND_SUCCESS;
}


static void Reset(void){
    asm ("reset");
}

static void ResetDevice(void)
{
    struct RESPONSE_TYPE_0 response = {
        .header1 = HEADER1,
        .header2 = HEADER2,
        .header3 = HEADER3,
        .total_length = 0xC,
        .cmd = 9,
        .dataLength = 0,
        .unlockSequence = 0,
        .address = 0,

        .success = COMMAND_SUCCESS
    };         
    
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0));

    BOOT_COM_Write((uint8_t*) & response, sizeof (struct RESPONSE_TYPE_0) / sizeof (uint8_t));
    
    Reset();
 }


static enum BOOT_COMMAND_RESULT EraseFlash(void)
{
    uint32_t eraseAddress;
    struct RESPONSE_TYPE_0 response;
    struct CMD_STRUCT_0 *pCommand = (struct CMD_STRUCT_0*) commandArray; 
    
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0));
            
    memcpy(&response, commandArray, sizeof(struct CMD_STRUCT_0));
    response.total_length = 0x0C;
    eraseAddress = pCommand->address;
    
    response.success = BAD_ADDRESS;
    if ( BOOT_BlockErase(pCommand->address, pCommand->dataLength, pCommand->unlockSequence) == NVM_SUCCESS)
    {
        response.success = COMMAND_SUCCESS;
    }     
    
    BOOT_COM_Write((uint8_t*) & response, sizeof (struct RESPONSE_TYPE_0) / sizeof (uint8_t));

    /* destroy the unlock key so it isn't sitting around in memory. */
    pCommand->unlockSequence = ~pCommand->unlockSequence;
    
    if(response.success == COMMAND_SUCCESS)
    {
        return BOOT_COMMAND_SUCCESS;
    }
    
    return BOOT_COMMAND_ERROR;
}

static enum BOOT_COMMAND_RESULT WriteFlash(void)
{
    struct CMD_STRUCT_0_WITH_PAYLOAD *pCommand = (struct CMD_STRUCT_0_WITH_PAYLOAD*) commandArray;
    struct RESPONSE_TYPE_0 response;
    uint32_t flashAddress;   
    uint16_t dataLength;
    
    dataLength = BOOT_COM_Peek(6u)<<8u;
    dataLength |= BOOT_COM_Peek(5u);
    
    if (BOOT_COM_GetBytesReady() < (sizeof(struct CMD_STRUCT_0) + dataLength))
    { 
        return BOOT_COMMAND_INCOMPLETE; 
    }  
    
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0) + dataLength);
    
    memcpy(&response, commandArray, sizeof(struct CMD_STRUCT_0));
    response.total_length = 0x0C;
    response.success = COMMAND_SUCCESS;

    flashAddress = pCommand->address;


    if (dataLength <= (BOOT_CONFIG_MAX_PACKET_SIZE - sizeof(struct CMD_STRUCT_0)))
    {
        if (BOOT_BlockWrite(pCommand->address, dataLength, &pCommand->data[0], pCommand->unlockSequence) != NVM_SUCCESS)
        {
            response.success = BAD_ADDRESS;   
        } 
    }   
    else
    {
        response.success = BAD_ADDRESS;
    }
    
    BOOT_COM_Write((uint8_t*) & response, sizeof (struct RESPONSE_TYPE_0) / sizeof (uint8_t));
    
    /* destroy the unlock key so it isn't sitting around in memory. */
    pCommand->unlockSequence = ~pCommand->unlockSequence;
    
    if(response.success == COMMAND_SUCCESS)
    {
        return BOOT_COMMAND_SUCCESS;
    }
    
    return BOOT_COMMAND_ERROR;
}
static enum BOOT_COMMAND_RESULT ReadFlash(void)
{
    struct RESPONSE_TYPE_0_WITH_PAYLOAD response;
    struct CMD_STRUCT_0_WITH_PAYLOAD * const pCommand = (struct CMD_STRUCT_0_WITH_PAYLOAD*) commandArray;
    
   (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0) );

    memcpy(&response, commandArray, sizeof(struct CMD_STRUCT_0));

    if (pCommand->dataLength <= (BOOT_CONFIG_MAX_PACKET_SIZE - sizeof(struct CMD_STRUCT_0) - 1u ))
    {
        NVM_RETURN_STATUS readStatus = BOOT_BlockRead ((uint8_t *)&response.data[0], pCommand->dataLength, pCommand->address );
        if (readStatus == NVM_SUCCESS)
        {    
            response.success = COMMAND_SUCCESS;
        } 
        else
        {
            response.success = BAD_ADDRESS;
            response.dataLength = 0u;        
        }
            
    } 
    else
    {
        response.success = BAD_ADDRESS;
        response.dataLength = 0u;        
    }
    
    BOOT_COM_Write((uint8_t*) & response, (sizeof (struct RESPONSE_TYPE_0) / sizeof (uint8_t)) + response.dataLength  );

    if(response.success == COMMAND_SUCCESS)
    {
        return BOOT_COMMAND_SUCCESS;
    }
    
    return BOOT_COMMAND_ERROR;
}


static enum BOOT_COMMAND_RESULT CalculateChecksum(void)
{
    struct RESPONSE_TYPE_0_2_PAYLOAD response;
    struct CMD_STRUCT_0 *pCommand = (struct CMD_STRUCT_0*) commandArray;
    uint32_t flashData;
    uint32_t checksum = 0;
    uint16_t count;
    
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0) );

    memcpy(&response, commandArray, sizeof(struct CMD_STRUCT_0));
    
    if ( IsLegalRange(pCommand->address, pCommand->address+pCommand->dataLength - 1u))
    {
        for (count = 0; count < pCommand->dataLength; count += 4u)
        {
            BOOT_BlockRead ((uint8_t*)&flashData, 4u,  pCommand->address + (count/2u));
            checksum += (flashData & 0xFFFFu) + ((flashData>>16u) & 0xFFu);;
        }
        response.data = (checksum & 0xFFFFu);

        response.success = COMMAND_SUCCESS;
        BOOT_COM_Write((uint8_t*) & response, (sizeof (struct RESPONSE_TYPE_0_2_PAYLOAD) / sizeof (uint8_t)) );  
    }
    else
    {
        response.success=BAD_ADDRESS;
        response.dataLength = 0;
        BOOT_COM_Write((uint8_t*) & response, (sizeof (struct RESPONSE_TYPE_0) / sizeof (uint8_t)) );  
    }
    
    if(response.success == COMMAND_SUCCESS)
    {
        return BOOT_COMMAND_SUCCESS;
    }
    
    return BOOT_COMMAND_ERROR;
} 

static enum BOOT_COMMAND_RESULT SelfVerify(void)
{
    struct RESPONSE_TYPE_0_2_PAYLOAD response;
    
    (void)BOOT_COM_Read((uint8_t*)&response, sizeof(struct CMD_STRUCT_0) );

    if(BOOT_ImageVerify(DOWNLOAD_IMAGE_NUMBER) == false)
    {
        response.success = VERIFY_FAIL;
    }
    else
    {
        response.success = COMMAND_SUCCESS;
    }

    response.dataLength = 0;
    BOOT_COM_Write((uint8_t*) &response, (sizeof (struct RESPONSE_TYPE_0) / sizeof (uint8_t)) );  
    
    if(response.success == COMMAND_SUCCESS)
    {
        return BOOT_COMMAND_SUCCESS;
    }
    
    return BOOT_COMMAND_ERROR;
} 

static enum BOOT_COMMAND_RESULT GetMemoryAddressRange(void)
{
   struct GET_MEMORY_ADDRESS_RANGE_RESPONSE response = {
        .header1 = HEADER1,
        .header2 = HEADER2,
        .header3 = HEADER3,
        .total_length = 0x14,
        .cmd = 0xB,
        .dataLength = 0x8,
        .unlockSequence = 0x0,
        .address = 0,   
        .success = 1,
        .programFlashStart = EXECUTABLE_IMAGE_FIRST_ADDRESS,
        .programFlashEnd = EXECUTABLE_IMAGE_LAST_ADDRESS
    };
    (void)BOOT_COM_Read(commandArray, sizeof(struct CMD_STRUCT_0));
    BOOT_COM_Write((uint8_t*) & response, sizeof (struct GET_MEMORY_ADDRESS_RANGE_RESPONSE ) / sizeof (uint8_t));

    return BOOT_COMMAND_SUCCESS;
}



   



